; domain
(define (domain miconic)
  (:requirements :strips)
  (:types passenger - object
          floor - object
         )

(:predicates 
(origin ?person - passenger ?floor - floor)
;; entry of ?person is ?floor
;; inertia

(destin ?person - passenger ?floor - floor)
;; exit of ?person is ?floor
;; inertia

(above ?floor1 - floor  ?floor2 - floor)
;; ?floor2 is located above of ?floor1

(boarded ?person - passenger)
;; true if ?person has boarded the lift

(not-boarded ?person - passenger)
;; true if ?person has not boarded the lift

(served ?person - passenger)
;; true if ?person has alighted as her destination

(not-served ?person - passenger)
;; true if ?person is not at their destination

(lift-at ?floor - floor)
;; current position of the lift is at ?floor
)


;;stop and allow boarding

(:action board
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (origin ?p ?f))
  :effect (boarded ?p))

(:action depart
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (destin ?p ?f)
		     (boarded ?p))
  :effect (and (not (boarded ?p))
	       (served ?p)))
;;drive up

(:action up
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f1 ?f2))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))


;;drive down

(:action down
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f2 ?f1))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))
)

; problem
; params: miconic -f 9 -p 8 -r 259923818






(define (problem mixed-f9-p8-u0-v0-d0-a0-n0-A0-B0-N0-F0)
   (:domain miconic)
   (:objects p0 p1 p2 p3 p4 p5 p6 p7 - passenger
             f0 f1 f2 f3 f4 f5 f6 f7 f8 - floor)


(:init
(above f0 f1)
(above f0 f2)
(above f0 f3)
(above f0 f4)
(above f0 f5)
(above f0 f6)
(above f0 f7)
(above f0 f8)

(above f1 f2)
(above f1 f3)
(above f1 f4)
(above f1 f5)
(above f1 f6)
(above f1 f7)
(above f1 f8)

(above f2 f3)
(above f2 f4)
(above f2 f5)
(above f2 f6)
(above f2 f7)
(above f2 f8)

(above f3 f4)
(above f3 f5)
(above f3 f6)
(above f3 f7)
(above f3 f8)

(above f4 f5)
(above f4 f6)
(above f4 f7)
(above f4 f8)

(above f5 f6)
(above f5 f7)
(above f5 f8)

(above f6 f7)
(above f6 f8)

(above f7 f8)



(origin p0 f4)
(destin p0 f1)

(origin p1 f4)
(destin p1 f8)

(origin p2 f5)
(destin p2 f3)

(origin p3 f0)
(destin p3 f2)

(origin p4 f3)
(destin p4 f4)

(origin p5 f2)
(destin p5 f7)

(origin p6 f1)
(destin p6 f8)

(origin p7 f8)
(destin p7 f3)






(lift-at f0)
)


(:goal


(and
(served p0)
(served p1)
(served p2)
(served p3)
(served p4)
(served p5)
(served p6)
(served p7)
))
)

; plan
1. (board f0 p3)
   added: (boarded p3)
   goals met: 0 of 8
2. (up f0 f8)
   deleted: (lift-at f0)
   added: (lift-at f8)
   goals met: 0 of 8
3. (board f8 p7)
   added: (boarded p7)
   goals met: 0 of 8
4. (down f8 f5)
   deleted: (lift-at f8)
   added: (lift-at f5)
   goals met: 0 of 8
5. (board f5 p2)
   added: (boarded p2)
   goals met: 0 of 8
6. (up f5 f8)
   deleted: (lift-at f5)
   added: (lift-at f8)
   goals met: 0 of 8
7. (down f8 f4)
   deleted: (lift-at f8)
   added: (lift-at f4)
   goals met: 0 of 8
8. (board f4 p1)
   added: (boarded p1)
   goals met: 0 of 8
9. (board f4 p0)
   added: (boarded p0)
   goals met: 0 of 8
10. (up f4 f8)
   deleted: (lift-at f4)
   added: (lift-at f8)
   goals met: 0 of 8
11. (depart f8 p1)
   deleted: (boarded p1)
   added: (served p1)
   goals met: 1 of 8
12. (down f8 f3)
   deleted: (lift-at f8)
   added: (lift-at f3)
   goals met: 1 of 8
13. (depart f3 p7)
   deleted: (boarded p7)
   added: (served p7)
   goals met: 2 of 8
14. (depart f3 p2)
   deleted: (boarded p2)
   added: (served p2)
   goals met: 3 of 8
15. (board f3 p4)
   added: (boarded p4)
   goals met: 3 of 8
16. (up f3 f8)
   deleted: (lift-at f3)
   added: (lift-at f8)
   goals met: 3 of 8
17. (down f8 f4)
   deleted: (lift-at f8)
   added: (lift-at f4)
   goals met: 3 of 8
18. (depart f4 p4)
   deleted: (boarded p4)
   added: (served p4)
   goals met: 4 of 8
19. (up f4 f8)
   deleted: (lift-at f4)
   added: (lift-at f8)
   goals met: 4 of 8
20. (down f8 f2)
   deleted: (lift-at f8)
   added: (lift-at f2)
   goals met: 4 of 8
21. (depart f2 p3)
   deleted: (boarded p3)
   added: (served p3)
   goals met: 5 of 8
22. (board f2 p5)
   added: (boarded p5)
   goals met: 5 of 8
23. (up f2 f8)
   deleted: (lift-at f2)
   added: (lift-at f8)
   goals met: 5 of 8
24. (down f8 f7)
   deleted: (lift-at f8)
   added: (lift-at f7)
   goals met: 5 of 8
25. (depart f7 p5)
   deleted: (boarded p5)
   added: (served p5)
   goals met: 6 of 8
26. (up f7 f8)
   deleted: (lift-at f7)
   added: (lift-at f8)
   goals met: 6 of 8
27. (down f8 f1)
   deleted: (lift-at f8)
   added: (lift-at f1)
   goals met: 6 of 8
28. (depart f1 p0)
   deleted: (boarded p0)
   added: (served p0)
   goals met: 7 of 8
29. (board f1 p6)
   added: (boarded p6)
   goals met: 7 of 8
30. (up f1 f8)
   deleted: (lift-at f1)
   added: (lift-at f8)
   goals met: 7 of 8
31. (depart f8 p6)
   deleted: (boarded p6)
   added: (served p6)
   goals met: 8 of 8
